# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [5]:
import pandas as pd

In [21]:
cur.execute('''SELECT firstName, lastName FROM employees
                                JOIN offices
                                USING(officeCode)
                                WHERE city = "Boston"''').fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [37]:
#cur.execute('''SELECT officeCode FROM employees;''')
#df1 = pd.DataFrame(cur.fetchall())
#df1.columns = [i[0] for i in cur.description]
#cur.execute('''SELECT officeCode From offices;''')
#df2 = pd.DataFrame(cur.fetchall())
#df2.columns = [i[0] for i in cur.description]
#print(df1.officeCode.nunique())
#print(df2.officeCode.nunique())
#print("There are no offices without employees")
print(len(cur.execute('''SELECT employeeNumber FROM employees;''').fetchall()))
cur.execute('''SELECT city, count(*) FROM offices 
                                    LEFT JOIN employees
                                    USING(officeCode)
                                    GROUP BY 1;''').fetchall()

23

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Paris', 5),
 ('San Francisco', 6),
 ('Sydney', 4),
 ('Tokyo', 2)]

In [ ]:
# There are no offices without employees

## Write 3 Questions of your own and answer them

In [91]:
# How many customers have never made an order?
df_customers = pd.DataFrame(cur.execute('''SELECT customerNumber from customers;'''))
#print(len(df_customers))
#print(df_customers.head())
cur.execute('''SELECT customerNumber, count(*) FROM customers
                                            LEFT JOIN orders
                                            using(customerNumber)
                                            GROUP BY 1
                                            LIMIT 5;''')
df_orderCounts = pd.DataFrame(cur.fetchall())
df_orderCounts.columns = [i[0] for i in cur.description]
df_orderCounts.sort_values(['count(*)'], inplace=True)

print(f"The minimum number of orders from any customer is {df_orderCounts['count(*)'].min()}")

The minimum number of orders from any customer is 3

In [90]:
# What is the name of the customer who paid the highest amount at any time?
customer_id = (cur.execute('''SELECT customerNumber, MAX(amount) FROM payments;''').fetchall())
customer = (cur.execute(f'''SELECT customerName 
                            FROM customers 
                            WHERE customerNumber = "{customer_id[0][0]}"''').fetchall())
print(f"Largest payment was ${customer_id[0][1]}, paid by {customer[0][0]}.")

Largest payment was $9977.85, paid by FunGiftIdeas.com.

In [92]:
# How many orders have shipped by state?
cur.execute('''SELECT state, count(*) FROM customers 
                                    LEFT JOIN orders 
                                    USING(customerNumber)
                                    GROUP BY 1;''').fetchall()

[('', 201),
 ('BC', 4),
 ('CA', 45),
 ('CT', 9),
 ('Co. Cork', 1),
 ('Isle of Wight', 2),
 ('MA', 23),
 ('NH', 3),
 ('NJ', 3),
 ('NSW', 8),
 ('NV', 3),
 ('NY', 18),
 ('Osaka', 2),
 ('PA', 9),
 ('Pretoria', 1),
 ('Queensland', 3),
 ('Qu√©bec', 3),
 ('Tokyo', 4),
 ('Victoria', 8)]

In [94]:
# How many products belong to each product line
cur.execute('''SELECT productLine, count(*) FROM productlines
                                            LEFT JOIN products
                                            USING(productLine)
                                            GROUP BY 1;''').fetchall()

[('Classic Cars', 38),
 ('Motorcycles', 13),
 ('Planes', 12),
 ('Ships', 9),
 ('Trains', 3),
 ('Trucks and Buses', 11),
 ('Vintage Cars', 24)]

## Level Up: Display the names of each product each employee has sold.

In [121]:
cur.execute('''SELECT firstName, lastName, productName
                    FROM employees e
                    JOIN customers c
                    ON e.employeeNumber = c.salesRepEmployeeNumber
                    JOIN orders o
                    using(customerNumber)
                    JOIN orderdetails
                    using(orderNumber)
                    JOIN products
                    using(productCode)''')
df = pd.DataFrame(cur.fetchall())
print(len(df))
df['name'] = df[0] + ' ' + df[1]
df = df.set_index('name').drop(columns=[0,1])
grouped = df.groupby('name').aggregate(lambda x: list(x))
[print(x) for x in grouped.loc['Andy Fixter']]

2996
['1996 Moto Guzzi 1100i', '2003 Harley-Davidson Eagle Drag Bike', 'P-51-D Mustang', '1936 Harley Davidson El Knucklehead', '1997 BMW R 1100 S', '1928 British Royal Navy Airplane', '1960 BSA Gold Star DBD34', '1900s Vintage Tri-Plane', '1997 BMW F650 ST', '1928 Ford Phaeton Deluxe', '1930 Buick Marquette Phaeton', 'American Airlines: B767-300', 'America West Airlines B757-200', 'ATA: B757-300', 'F/A 18 Hornet 1/72', '1937 Lincoln Berline', '1928 Mercedes-Benz SSK', '1969 Harley Davidson Ultimate Chopper', '1996 Moto Guzzi 1100i', '2003 Harley-Davidson Eagle Drag Bike', 'P-51-D Mustang', '1936 Harley Davidson El Knucklehead', '1997 BMW R 1100 S', '1928 British Royal Navy Airplane', '1960 BSA Gold Star DBD34', '1900s Vintage Tri-Plane', '1997 BMW F650 ST', '1928 Ford Phaeton Deluxe', '1930 Buick Marquette Phaeton', 'American Airlines: B767-300', 'ATA: B757-300', 'F/A 18 Hornet 1/72', '1993 Mazda RX-7', '1948 Porsche 356-A Roadster', '1995 Honda Civic', '1992 Ferrari 360 Spider red', '1969 Dodge Super Bee', '1976 Ford Gran Torino', '1957 Vespa GS150', '1957 Corvette Convertible', '1982 Lamborghini Diablo', '1971 Alpine Renault 1600s', '1956 Porsche 356A Coupe', '1952 Alpine Renault 1300', '1962 LanciaA Delta 16V', '1958 Setra Bus', '1940 Ford Pickup Truck', '1936 Mercedes-Benz 500K Special Roadster', '1926 Ford Fire Engine', '1928 Mercedes-Benz SSK', '1913 Ford Model T Speedster', '1934 Ford V8 Coupe', '18th Century Vintage Horse Carriage', '1917 Maxwell Touring Car', '1940s Ford truck', '1993 Mazda RX-7', '1965 Aston Martin DB5', '1995 Honda Civic', '1999 Indy 500 Monte Carlo SS', '1992 Ferrari 360 Spider red', '1948 Porsche Type 356 Roadster', '1932 Alfa Romeo 8C2300 Spider Sport', '1957 Ford Thunderbird', '1970 Chevy Chevelle SS 454', '1966 Shelby Cobra 427 S/C', '1949 Jaguar XK 120', '1952 Citroen-15CV', '1969 Chevrolet Camaro Z28', '2002 Chevy Corvette', '1968 Ford Mustang', '2002 Suzuki XREO', '1970 Plymouth Hemi Cuda', '1969 Dodge Super Bee', '1976 Ford Gran Torino', '1957 Vespa GS150', '1957 Corvette Convertible', '1982 Ducati 900 Monster', '1971 Alpine Renault 1600s', '1961 Chevrolet Impala', '1982 Ducati 996 R', '1974 Ducati 350 Mk3 Desmo', '2002 Yamaha YZR M1', '1962 LanciaA Delta 16V', '1958 Setra Bus', '1940 Ford Pickup Truck', '1964 Mercedes Tour Bus', '1926 Ford Fire Engine', '1992 Ferrari 360 Spider red', '1940s Ford truck', '1939 Cadillac Limousine', '1996 Peterbilt 379 Stake Bed with Outrigger', '1952 Alpine Renault 1300', '1962 LanciaA Delta 16V', '1958 Setra Bus', '1940 Ford Pickup Truck', '1937 Lincoln Berline', '1936 Mercedes-Benz 500K Special Roadster', '1926 Ford Fire Engine', '1913 Ford Model T Speedster', '1939 Chevrolet Deluxe Coupe', '1938 Cadillac V-16 Presidential Limousine', '1937 Lincoln Berline', '1936 Mercedes-Benz 500K Special Roadster', '1928 Mercedes-Benz SSK', '1913 Ford Model T Speedster', '1934 Ford V8 Coupe', '18th Century Vintage Horse Carriage', '1917 Maxwell Touring Car', '1936 Chrysler Airflow', '1952 Alpine Renault 1300', '1962 LanciaA Delta 16V', '1958 Setra Bus', '1940 Ford Pickup Truck', '1913 Ford Model T Speedster', '18th Century Vintage Horse Carriage', '1940s Ford truck', '1939 Cadillac Limousine', '1980‚Äôs GM Manhattan Express', '1996 Peterbilt 379 Stake Bed with Outrigger', '1982 Camaro Z28', '1969 Harley Davidson Ultimate Chopper', '1996 Moto Guzzi 1100i', '1937 Horch 930V Limousine', 'Corsair F4U ( Bird Cage)', '1900s Vintage Tri-Plane', '1928 Ford Phaeton Deluxe', '1930 Buick Marquette Phaeton', 'American Airlines: B767-300', 'HMS Bounty', 'America West Airlines B757-200', 'ATA: B757-300', 'F/A 18 Hornet 1/72', 'American Airlines: MD-11S', 'Boeing X-32A JSF', '1917 Grand Touring Sedan', '1911 Ford Town Car', '1932 Model A Ford J-Coupe', '1932 Alfa Romeo 8C2300 Spider Sport', '1957 Ford Thunderbird', '1970 Chevy Chevelle SS 454', '1966 Shelby Cobra 427 S/C', '1939 Chevrolet Deluxe Coupe', '1949 Jaguar XK 120', '1952 Citroen-15CV', '1969 Chevrolet Camaro Z28', '2002 Chevy Corvette', '1936 Mercedes Benz 500k Roadster', '1970 Triumph Spitfire', '1970 Dodge Coronet', '1992 Porsche Cayenne Turbo Silver', "1950's Chicago Surface Lines Streetcar", '1952 Alpine Renault 1300', '1958 Setra Bus', '1940 Ford Pickup Truck', '1913 Ford Model T Speedster', '1939 Cadillac Limousine', '1996 Moto Guzzi 1100i', '2003 Harley-Davidson Eagle Drag Bike', 'P-51-D Mustang', '1936 Harley Davidson El Knucklehead', '1997 BMW R 1100 S', '1928 British Royal Navy Airplane', '1937 Lincoln Berline', '1936 Mercedes-Benz 500K Special Roadster', '1917 Grand Touring Sedan', '1911 Ford Town Car', '1932 Model A Ford J-Coupe', '1928 Mercedes-Benz SSK', '1913 Ford Model T Speedster', '1934 Ford V8 Coupe', '18th Century Vintage Horse Carriage', '1917 Maxwell Touring Car', '1932 Alfa Romeo 8C2300 Spider Sport', '1957 Ford Thunderbird', '1939 Chevrolet Deluxe Coupe', '1938 Cadillac V-16 Presidential Limousine', '1936 Mercedes Benz 500k Roadster', '1936 Chrysler Airflow', '1969 Dodge Super Bee', '1976 Ford Gran Torino', '1941 Chevrolet Special Deluxe Cabriolet', '1900s Vintage Bi-Plane', '1937 Horch 930V Limousine', 'HMS Bounty', 'Boeing X-32A JSF']

                    2
name
Andy Fixter        82
Barry Jones        98
Foon Yue Tseng     74
George Vanauf      96
Gerard Hernandez  109

## Level Up: Display the Number of Products each Employee Has sold

In [122]:
# This is the number of products each emplyee has sold
prod_per_employee = df.groupby('name').nunique()
prod_per_employee.head()

                    2
name
Andy Fixter        82
Barry Jones        98
Foon Yue Tseng     74
George Vanauf      96
Gerard Hernandez  109

In [124]:
# This is the total number of items sold by employee, but probably not even that because there was
# a 'quantityOrdered' column that has not been factored, so really this number is meaningless
sales_per_employee = df.groupby('name').count()
sales_per_employee.head()

                    2
name
Andy Fixter       185
Barry Jones       220
Foon Yue Tseng    142
George Vanauf     211
Gerard Hernandez  396

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!